{
  "architectures": [
    "RobertaForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "roberta",
  "num_attention_heads": 8,
  "num_hidden_layers": 8,
  "pad_token_id": 1,
  "tie_word_embeddings": false,
  "transformers_version": "5.0.0rc1",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 35000
}
